[
    {
        "slug": "kappa-theta",
        "title": "Kappa Theta",
        "description": "Kappa Theta is a female social group at Cornell College - Cornell's equivalent to a Sorority.  The women of Kappa Theta hired me to design a simple informational web site.  After designing the site, I trained one of the women to update the content via Macromedia Dream Weaver.\r\n\r\nIt turned out to be a very useful tool to easily communicate the message, purpose, and goals of the group.  5 years later, I ended up marrying one of them!",
        "featured": 0,
        "updatedAt": "2000",
        "url": null,
        "tags": [
            "graphic-design",
            "html"
        ],
        "versions": []
    },
    {
        "slug": "advantage-group",
        "title": "Advantage Group",
        "description": "The Advantage Group is an investment company based in Cedar Rapids Iowa.  They were a client for one of my employers and hired me to do their web site.  This site was fairly simple but needed to be extremely clean, professional, and still be able to relay a large amount of information to the reader.\r\n\r\nThe site turned out just as planned and served as a great tool for The Advantage Group.  It has since been redesigned to meet new technologies and features.",
        "featured": 0,
        "updatedAt": "2001",
        "url": null,
        "tags": [
            "graphic-design",
            "html"
        ],
        "versions": []
    },
    {
        "slug": "computing-services",
        "title": "Computing Services",
        "description": "While at Cornell, I worked for Computing Services - the department that managed all of Information Technology.  As part of my work-study I was hired to design a site for our department.  It was my first experience with coding web sites with things other than straight HTML, CSS, and JavaScript.  I used some perl and several included .nav files for easy navigation manipulation.\r\n\r\nMy main duty was to fix old links, remove unwanted content, add new content, and update various items throughout.  Due to such a large amount of changes, I ended up recoding most of the site from scratch.  Everything except for the RESnet section was my work.  At the time, if you saw a little \"x\" at the bottom of the page - I programmed it.  Cornell's entire site has since been redesigned and my pages are not there.",
        "featured": 0,
        "updatedAt": "2001",
        "url": null,
        "tags": [
            "css",
            "html",
            "javascript",
            "perl"
        ],
        "versions": []
    },
    {
        "slug": "paac",
        "title": "PAAC",
        "description": "PAAC (Performing Arts and Activities Council) is an organization at Cornell College that organized all entertainment on campus.  I was hired as a technician and web master for the 2001-2002 school year.  As technician I was in charge of setting up and running all audio/video equipment at our events.  As web master I had complete reign over the site.\r\n\r\nWhen I first joined this group the site was programmed via Macromedia Dream Weaver and was quite simple.  I recreated the site from scratch, giving it a more uniform, professional look that was very easy to navigate.  I also integrated some Flash animation for aesthetics.\r\n\r\nThe color scheme may not not have been the best, but it was our school colors and the overall layout turned out very nice.",
        "featured": 0,
        "updatedAt": "2001",
        "url": null,
        "tags": [
            "css",
            "flash",
            "graphic-design",
            "html"
        ],
        "versions": []
    },
    {
        "slug": "brooksfsw",
        "title": "BrooksFSW",
        "description": "BrooksFSW was a site dedicated to Soap Shoes, a company that makes shoes capable of sliding across objects such as handrails, benches, etc.  The activity of \"soaping\" is very similar to grinding with inline skates or skateboards.  I have done promotional work for Soap Shoes for several years - this site was a huge part of that.\r\n\r\nBrooksFSW was a portal site using PHP Nuke to develop a community for \"Soapers.\"  It kept users informed on the latest news and happenings with the company.  It also kept everyone involved in friendly competition with photos, polls, forums, and videos.  This was the first site I ran that used an extensive PHP and MySQL back-end.\r\n\r\nBrooksFSW was an excellent learning experience for me.  My mentor, Harper Reed, helped tremendously with the initial setup and training.  It was released in September 2000 and integrated into Broox Exteme in October 2001.  During that year it received nearly 620,000 hits and had 800 registered users.  The site also had 441 news articles published and over 6,000 comments on those articles.\r\n\r\nBrooksFSW received some great recognition from large medias such as the British Broadcasting Corporation, The Mount Vernon Sun, The Rock Island Dispatch, and the Cedar Rapids Gazette.\r\n\r\nDisclaimer: Since BrooksFSW has been released from my posession, another company has decided to purchase the domain name, due to its high popularity. The company now owns BrooksFSW and has used the domain to display various advertising and  pornographic material.  I suggest you not visit the new BrooksFSW and simply look at the screenshot displayed here. I also have no affiliation with the current owner of the website and assure you that everything on my portfolio is safe for your viewing. ",
        "featured": 0,
        "updatedAt": "2000-09-01",
        "url": null,
        "tags": [
            "graphic-design",
            "html",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "broox-extreme",
        "title": "Broox Extreme",
        "description": "Broox Extreme was the former version of SolidGrind.com, it was an extreme sports website that included 6 categories: bmx, inline, scooter, skateboard, snowboard, and soap. Each section had the latest news and information along with user submitted photos and videos. \r\n\r\nI hired several authors who specialized in at least one category of the site to help me keep everyone informed of what's going on. \r\n\r\nAlmost a year after the site was released (October 2001), broox.com received over 700,000 hits and had nearly 700 registered users. Upon closing, the site was just shy of 1 million hits. \r\n\r\nYM (Your Magazine) found this site and contacted me in order to feature some of my \"Soaping Buddies\" and I. They flew out from New York to do a day long photoshoot of us \"Soaping.\" We were all featured in the April, 2002 of YM magazine!",
        "featured": 0,
        "updatedAt": "2001-10-24",
        "url": null,
        "tags": [
            "css",
            "graphic-design",
            "html",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "spanish-flashcards",
        "title": "Spanish Flashcards",
        "description": "I made this web application for a computer science class at Cornell. One of the projects suggested was a flashcard program written in the language of our choice. Needless to say, I chose PHP/MySQL in a heartbeat.  \r\n\r\nThe program allowed users to choose whether they wanted to test their vocabulary from English to Spanish or from Spanish to English. I wrote functionality that retrieves random words from the database every time they choose a new card. Once a card is selected it is marked as 'viewed'. This would make sure the program goes through every card before it repeats one of the previous ones. It was also designed so the user could choose which type of words they wanted to learn. They could select from adjectives, nouns, verbs, or all at once.",
        "featured": 0,
        "updatedAt": "2002-01-25",
        "url": null,
        "tags": [
            "html",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "the-simple-truth-cornell-college",
        "title": "The Simple Truth @ Cornell College",
        "description": "This is one of the many sites I built while on the Cornell College student webteam. It is probably my favorite, due to the deadlines and how well everything worked out. First of all, I had a 4 day deadline on this project. Cornell introduced a new marketing scheme to give students information about the college, which was titled \"The Simple Truth.\" The college had hundreds of pamphlets printed out, which they would send to everyone who visited truth.cornellcollege.edu. On top of that we even had an advertisement going into U.S. News, which had a link to the site I was supposed to build (hence the short deadline).\r\n\r\nThe site was only to be 1 page long, had to open in a static sized window, and needed to have a PHP based form to insert information into a database.  On top of all of that, they wanted flash animation for the header.  The screenshot pictured is simply of the flash animation.",
        "featured": 0,
        "updatedAt": "2002-08-01",
        "url": null,
        "tags": [
            "flash",
            "html",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "lujack-intranet",
        "title": "Lujack Intranet",
        "description": "I held an internship at Lujack's Northpark Auto Plaza for the month of September 2002. During this month one of my projects was to build an intranet system to allow administrators to post news and happenings within the plaza. The site uses a PHP/MySQL back-end to submit news, and also to display uploaded articles. Since the people who will be administering the site don't know much about web design, I've made this site as simple and fool proof as possible. They are currently using the intranet system and it is proving to be very helpful for relaying information throughout the plaza.",
        "featured": 0,
        "updatedAt": "2002-09-26",
        "url": null,
        "tags": [
            "html",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "lujacks-suv-trails",
        "title": "Lujack's SUV Trails",
        "description": "I designed this site for Lujack's Northpark Auto Plaza, where I previously held my internship. Lujack's is the fist dealership in the country to have their own SUV offroad test track. This track has several obstacle's to test the performance of sport utility vehicles. \r\n\r\nThe screenshot shown is a portion of the virtual map I built for Lujack's. When a user holds their mouse over an obstacle a description is shown in the description box; if an obstacle is clicked on, a small video clip will be played in Quicktime format.",
        "featured": 0,
        "updatedAt": "2002-09-26",
        "url": null,
        "tags": [
            "graphic-design",
            "html",
            "javascript",
            "video-production"
        ],
        "versions": []
    },
    {
        "slug": "3g-screensaver",
        "title": "3G Screen Saver",
        "description": "3g Screen Saver is another site that Harper Reed hired me to design.  The site's purpose is to host screensavers and ringtones for Sprint phones. Harper wanted a design with blue and silver colors, a picture of a sprint phone, and an area for banner ads.  The rest of the site was to be very lite.\r\n\r\nThe finished product turned out very nice and the site became a huge success for Harper.",
        "featured": 0,
        "updatedAt": "2002-10-12",
        "url": null,
        "tags": [
            "graphic-design",
            "html"
        ],
        "versions": []
    },
    {
        "slug": "kronus-films",
        "title": "Kronus Films",
        "description": "This is a design that I completed while working for NaTa2 Productions. The client, Kronus Entertainment, is a film production company specializing in underwater video shooting. At the time, they were working on breaking an underwater world record as a fund-raiser. The goal is to make a 100 mile trip around an island which will be approximately 24 hours underwater; the money raised was used to assist ill children. Kronus has a variety of extremely powerful equipment and talented personnel. \r\n\r\nThey came to us needing a professional web site to portray their image and draw more attention to their company.",
        "featured": 0,
        "updatedAt": "2002-11-02",
        "url": "http://www.kronusfilms.com",
        "tags": [
            "css",
            "graphic-design",
            "html"
        ],
        "versions": []
    },
    {
        "slug": "james-h-laas-company",
        "title": "James H. Laas Company",
        "description": "I developed this site for the James Laas Company out of Bettendorf, Iowa. It was one of the largest, most complex, and complete systems that I have built. \r\n\r\nPrior to my development, they made all of their updates via HTML - a database was very much needed. They have a huge amount of information which became quite redundant in the way that they were displaying it. \r\n\r\nI designed a more aesthetically pleasing site that used a PHP/MySQL back-end. With the new design, I concentrated mostly on the ease of navigation and finding vital information quickly, which was successfully attained. Their site is now completely free of FTP and is updateable via an administration section in which I created. The database has proven to be very useful as the James Laas company writes several articles per month. This site is also the home of the first \"site wide\" search engine that I have built. Jhlaas.com was a huge success and a great learning experience.",
        "featured": 0,
        "updatedAt": "2002-12-12",
        "url": "http://www.jhlaas.com",
        "tags": [
            "css",
            "flash",
            "graphic-design",
            "html",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "wireless-wallpapers",
        "title": "Wireless Wallpapers",
        "description": "Wireless Wallpapers is a personal project that I have chose to take on. It was a site that allowed users to download color wallpapers for their color screened mobile phones. \r\n\r\nAt the time there were several sites offering this service however nearly all of them only supported one type of phone or charged money for each wallpaper downloaded (usually $1.00 per wallpaper). Wireless Wallpapers allowed users to download unlimited wallpapers for free, which were available for several types of phones. The free wallpapers had a tiny \"wirelesswallpapers\" watermarks near the bottom of the image, however if the user paid a small fee each month, they could get more features (such as private wallpapers) and the watermark was removed. In addition to this, I wrote a function to allow users to upload their own images to the website which gave me the ability to let the site run itself. The function I wrote automatically resized the image they uploaded into wallpaper size and printed my watermark to the image on its own. The site was a huge sucess and learning experience. The first day it was online it received 7,000 hits and had nearly 100 users. After the first week there were nearly 50,000 hits and 500 users.  Upon selling the site, I had over 24,000 users and received over 3,200,000 hits.",
        "featured": 0,
        "updatedAt": "2003-01-31",
        "url": null,
        "tags": [
            "e-commerce",
            "graphic-design",
            "html",
            "image-processing",
            "mysql",
            "paypal",
            "php",
            "wap"
        ],
        "versions": []
    },
    {
        "slug": "the-jugglers",
        "title": "The Jugglers",
        "description": "Three years after the original site had gone live Harper Reed hired me to do another design.\r\n\r\nThe new site is basically a blog running movable type to update Jugglers in the Chicago area about upcoming events.",
        "featured": 0,
        "updatedAt": "2003-03-03",
        "url": "http://www.thejugglers.org",
        "tags": [
            "css",
            "graphic-design",
            "html"
        ],
        "versions": []
    },
    {
        "slug": "solid-grind",
        "title": "Solid Grind",
        "description": "SolidGrind is the site that took over the former Broox Extreme (www.broox.com). I wanted to use broox.com as a hub with links to all of my web sites; in order to do this, I had to come up with a new extreme sports site. After I came up with the name and domain, I decided that I wanted to code the entire thing from scratch, rather than customize a prebuilt system. Coding the entire site has paid off numerous times; I now have full control and understanding of the system and can add on, fix bugs, and rebuild very easily.\r\n\r\nOne of the most complex parts of SolidGrind was the \"feature pic\" system. It allowed users to upload pictures to be reviewed by the administrators I hired.  These pictures were queued in a database and could be viewed by the administrators. If we saw one we liked, we simply clicked a button to set it as the feature pic. This button contained functionality to automatically adjust the size of the image, add a SolidGrind.com watermark to each image, create a thumbnail of the image, store it in the database, and place the picture on the homepage until a new picture is added. In addition, I designed it so that each picture has to be featured for at least 24 hours; this gives everyone a fair amount of time on our frontpage.\r\n\r\nBesides photos, the site featured news, forums, tutorials, videos, and several other things related to extreme sports.",
        "featured": 0,
        "updatedAt": "2003-05-28",
        "url": null,
        "tags": [
            "e-commerce",
            "graphic-design",
            "html",
            "image-processing",
            "mysql",
            "paypal",
            "php"
        ],
        "versions": [
            {
                "version": "v1",
                "description": "SolidGrind is the site that took over the former Broox Extreme (www.broox.com). I wanted to use broox.com as a hub with links to all of my web sites; in order to do this, I had to come up with a new extreme sports site. After I came up with the name and domain, I decided that I wanted to code the entire thing from scratch, rather than customize a prebuilt system. Coding the entire site has paid off numerous times; I now have full control and understanding of the system and can add on, fix bugs, and rebuild very easily.\r\n\r\nOne of the most complex parts of SolidGrind was the \"feature pic\" system. It allowed users to upload pictures to be reviewed by the administrators I hired.  These pictures were queued in a database and could be viewed by the administrators. If we saw one we liked, we simply clicked a button to set it as the feature pic. This button contained functionality to automatically adjust the size of the image, add a SolidGrind.com watermark to each image, create a thumbnail of the image, store it in the database, and place the picture on the homepage until a new picture is added. In addition, I designed it so that each picture has to be featured for at least 24 hours; this gives everyone a fair amount of time on our frontpage.\r\n\r\nBesides photos, the site featured news, forums, tutorials, videos, and several other things related to extreme sports.",
                "createdAt": "2003-05-28"
            },
            {
                "version": "v2",
                "description": "I re-released Solid Grind to get away from the extreme sports feel of the site.  There are so many other extreme sports sites with a full staff dedicated to maintaining them - I decided to go back to Soap Shoes.  No one else has this thorough of a site dedicated to Soap Shoes.\r\n\r\nI worked with Nicole Sutherland on the design of this site, which turned out to work very well for the content being delivered.\r\n\r\nThe new version of the site is much more complete, the code is all much more efficient, and photo manipulation is handled 10 times better.  With the initial version of SolidGrind I was very proud of the photo management system - this system blows it away.  It is much more versatile in that most image manipulation is done on the fly.",
                "createdAt": "2006-03-06"
            }
        ]
    },
    {
        "slug": "we-own-the-sun",
        "title": "We Own The Sun",
        "description": "One day, a couple friends and I decided to claim the sun.  So we quickly designed this web site to let the world know that \"we own the sun.\"\r\n\r\nThe site we created sells plots of the sun as real estate and donates part of the profits to cancer research.\r\n\r\nI was in charge of the site's design and some of the creative content.",
        "featured": 0,
        "updatedAt": "2003-10-21",
        "url": "http://www.weownthesun.com",
        "tags": [
            "css",
            "graphic-design",
            "html"
        ],
        "versions": []
    },
    {
        "slug": "learn-to-yo-yo",
        "title": "Learn To Yo-Yo",
        "description": "Learn to Yo-Yo is a site dedicated to teaching kids new yo-yo tricks.  Pro yo-yoers update the site with video and tutorials.\r\n\r\nMy job in this project was to simply come up with a lite front end design, which you can see displayed here.",
        "featured": 0,
        "updatedAt": "2003-10-21",
        "url": null,
        "tags": [
            "css",
            "graphic-design",
            "html"
        ],
        "versions": []
    },
    {
        "slug": "regulatory-solutions-inc",
        "title": "Regulatory Solutions Inc",
        "description": "When Regulatory Solutions Inc. wanted to get an online presence established, they approached my partner and I to help them get started. Their site's purpose is to provide a large amount of regulatory information to their customers in a quick and simple fashion. To accomplish this, we designed an easy-to-use, flexible system that allows users to retrieve their information as quickly as possible.\r\n\r\nWe also designed an administrative system to provide Regulatory Solutions Inc. with the same quick and simple service for updating the site. The system allows them to easily add and manage users, documents, and updates. This enables their customers to get the most up-to-date news to help with their regulatory decision making.",
        "featured": 0,
        "updatedAt": "2004-02-26",
        "url": null,
        "tags": [
            "html",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "vedanta-gallery",
        "title": "Vedanta Gallery",
        "description": "Vedanta is an Art Gallery located in Chicago, IL. They approached my partnership seeking a PHP add-on to their current site, which lists past, current, and upcoming exhibition details. The system we designed allows them to easily and quickly add and manage exhibitions through an administration system.\r\n\r\nAll exhibition information is managed by a PHP/MySQL backend. The front end allows visitors to quickly access information and photos for current, upcoming, and past exhibitions at the gallery.\r\n\r\nSince the release of this site the gallery has changed their name - however I believe they are still using the web system we built.",
        "featured": 0,
        "updatedAt": "2004-04-13",
        "url": null,
        "tags": [
            "html",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "trek-for-kids",
        "title": "Trek For Kids",
        "description": "Trek For Kids is a fundraising bike ride for The Boys and Girls Club of Dane County; the web site provides information about the ride, lets people register to ride, and also lets people make pledges to the riders.\r\n\r\nA friend of mine contacted me to contract out the development for part of this site.  Shortly after, my partner and I were hired for the job by a company in Madison, WI.  We were to design and program the rider registration, pledge donations, and full administration/reporting tools. Since this site requires credit card use, both, the registration and donation sections run from a secure server and use encryption in order to ensure protection for the visitors. The administration panel lets Trek For Kids manage users, teams, donations, etc. It also gives them full reporting to keep them up to date on how many have registered, which riders are on which teams, and how the pledges stand.",
        "featured": 0,
        "updatedAt": "2004-06-29",
        "url": null,
        "tags": [
            "authorize-net",
            "e-commerce",
            "html",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "sae-long-beach",
        "title": "SAE Long Beach",
        "description": "A friend of mine from the The Long Beach chapter of Sigma Alpha Epsilon contacted me seeking some add-ons to their currently designed site.  In this add-on, they wanted an administration system to allow for easy updating and management of active members, alumni, alumni job postings, dues, a calendar of events, etc.\r\n\r\nMy partner and I were able to provide them with a very user-friendly administration panel to manage all of this data. SAE also wanted a photo gallery and forum which we installed and fit 2 previously built systems for. The site now displays all of this database driven information in a very organized manner.",
        "featured": 0,
        "updatedAt": "2004-06-29",
        "url": null,
        "tags": [
            "html",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "falaphilia",
        "title": "Falaphilia",
        "description": "On october 14th 2004, Bill O'Reilly from Fox News was threathened with a sexual harrassment lawsuit. A typo was made on the lawsuit transcript. Instead of loufa the officer put falafel. Some friends and I found this hilarious so we put up a website talking about \"Falaphilia.\"\r\n\r\nEven though it started as a viral joke. We ended up having approximately 50,000 visitors in the first 48hrs and peaked at 100,000 visitors in the first week. We then switched it up and served large political content to the blogger demograph and pulled 3.7 terabytes of transfer in 5 days.\r\n\r\nI handled the design of this site as well as some creative content, and made a graphic of O'reilly hugging a giant piece of falafel.",
        "featured": 0,
        "updatedAt": "2004-10-15",
        "url": "http://www.falaphilia.com",
        "tags": [
            "css",
            "graphic-design",
            "html"
        ],
        "versions": []
    },
    {
        "slug": "iowa-meth-watch",
        "title": "Iowa Meth Watch",
        "description": "Iowa Meth Watch (local partner of the Meth Watch program) approached my partnership seeking a similar site to the national Meth Watch site. The main difference was to include more personalization, relation, and focus to the State of Iowa. We recreated graphics, created and enhanced flash animations, cleaned up code, and added new text to help integrate the state of Iowa into the Meth Watch program.",
        "featured": 0,
        "updatedAt": "2004-11-02",
        "url": "http://www.iowamethwatch.com",
        "tags": [
            "css",
            "html"
        ],
        "versions": []
    },
    {
        "slug": "soft-focus-art",
        "title": "Soft Focus Art",
        "description": "Soft Focus Art is a local Hip Hop and DJ group who came to my partnership with a limited budget and hope for a very complex web site. They wanted a database driven site in order to update their viewers with upcoming shows, bios, media, and news; but they also wanted to keep the look fairly simple with crisp lines and have everything displayed via Flash animation. We helped them out and provided a simple animated design with a powerful back-end using PHP, MySQL, and XML  for easy updating.",
        "featured": 0,
        "updatedAt": "2004-11-02",
        "url": "http://www.softfocusart.com/",
        "tags": [
            "flash",
            "graphic-design",
            "html",
            "mysql",
            "php",
            "xml"
        ],
        "versions": []
    },
    {
        "slug": "iowa-retail-federation",
        "title": "Iowa Retail Federation",
        "description": "Iowa Retail Federation came to my partnership needing a refreshing of their current site. The information on their site was good, but they needed a way to manage it easily and efficiently. We worked with them to provide a website that met their current and future needs.",
        "featured": 0,
        "updatedAt": "2005-01-19",
        "url": null,
        "tags": [
            "html",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "iowa-business-alliance",
        "title": "Iowa Business Alliance",
        "description": "Iowa Business Alliance came to my partnership with a design in place.  They needed our skills to bring their vision to life. We gave them a useful, updateable website that they could use to attract potential clients.\r\n\r\nTechnologies used for this solution were HTML, CSS, JS, PHP, and MySQL.",
        "featured": 0,
        "updatedAt": "2005-03-10",
        "url": null,
        "tags": [
            "css",
            "html",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "rebels-advocate",
        "title": "Rebels Advocate",
        "description": "Rebels Advocate is a Midwest Hip Hop group that got together in Iowa City. With their gaining popularity they decided they needed a strong web presence to show the world what they are all about.\r\n\r\nRebels Advocate was referred to my partnership needing both a web site and a music video. With a very limited budget, we had to cut a lot of corners, but the results of both the video and the web site are very pleasing. The site allows visitors to check out their bio, video, photos, and most importantly, their music. We also installed a community driven forum to keep visitors coming back to the site and a statistic program in order to track the site's hits.",
        "featured": 0,
        "updatedAt": "2006-01-22",
        "url": "http://www.rebelsadvocate.com",
        "tags": [
            "css",
            "graphic-design",
            "html",
            "mysql",
            "php",
            "video-production"
        ],
        "versions": []
    },
    {
        "slug": "truespin-media",
        "title": "Truespin Media",
        "description": "Truespin Media is a small partnership that my friend, Nick Leeper, and I started up.  Its basically just around so that we can split profits on side-projects.  \r\n\r\nWe originally planned on offering several services including: video production, photography, graphic design, and web design.  However, we've focused primarily on the last 2.",
        "featured": 0,
        "updatedAt": "2006-03-29",
        "url": "http://www.truespin-media.com",
        "tags": [
            "html",
            "mysql",
            "php"
        ],
        "versions": [
            {
                "version": "v1",
                "description": "The first version of the Truespin Media site was to be a portfolio for all of our work.  The site was thrown together fairly quickly while we were focusing on other client work.",
                "createdAt": "2004-01-26"
            },
            {
                "version": "v2",
                "description": "After realizing that we were mainly focusing on web design and not the other services we offered, we decided to redesign the site.\r\n\r\nThis version of our site is much lighter and contains only relevant information.\r\n\r\nWith this release we also drastically updated our portfolio - with all the work we were doing, we didn't have enough time to update our own site!",
                "createdAt": "2006-03-29"
            }
        ]
    },
    {
        "slug": "aeon-grey",
        "title": "Aeon Grey",
        "description": "I built this site for Aeon Grey, a Des Moines hip hop artist, to promote both himself and his 5th solo album: Primate Curriculum.\r\n\r\nAeon Grey wanted a very lite site that would include a forum and also allow him to publish photos, videos, and mp3s.  The site's news is integrated with the forum to allow Aeon to display important updates on the home page.  I worked with the graphic designer, Mindy Hoskin, for the graphic elements, which are taken primarily from the album art that she designed.\r\n\r\nI also do some of Aeon Grey's photography and videography.  We plan on starting a music video soon.",
        "featured": 0,
        "updatedAt": "2006-05-19",
        "url": "http://www.aeongrey.com",
        "tags": [
            "css",
            "graphic-design",
            "html",
            "mysql",
            "php",
            "video-production"
        ],
        "versions": []
    },
    {
        "slug": "515-alive",
        "title": "515 Alive",
        "description": "515 Alive is an urban music festival that takes place in Des Moines, IA.  We donated this simple dynamic informational site to relay event times and locations.\r\n\r\nThe site's simplicity is largely due to the very short deadline and last minute event changes.\r\n\r\nI worked closely with a designer for some of the elements.  ",
        "featured": 0,
        "updatedAt": "2006-07-25",
        "url": null,
        "tags": [
            "css",
            "graphic-design",
            "html",
            "javascript"
        ],
        "versions": []
    },
    {
        "slug": "five-point-studios",
        "title": "Five Point Studios",
        "description": "Five point studios is a professional piercing and custom tattoo shop in Johnston, IA.  I was given the opportunity to revamp their severely outdated web site.\r\n\r\nI programmed the site so that the shop could add/edit any page as well as add/edit staff members and staff portfolio images.\r\n\r\nIn the design I incorporated one of the shop's tattoo sketches.  The shop also wanted a very artistic font in their design.  And as with any web site, if the visitors don't have your font installed, they won't see your fancy text.  So, using PHP's GD library, I wrote functionality to dynamically load their font and create fancy title images on the fly.\r\n\r\nThe site will be much more successful in allowing Five Point to show off the incredible work that consistantly comes out of their shop.",
        "featured": 0,
        "updatedAt": "2007-09-24",
        "url": "http://www.5pointbody.com",
        "tags": [
            "css",
            "graphic-design",
            "html",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "brt-realty",
        "title": "BRT Realty",
        "description": "BRT Realty is a commercial real estate company who my company, Red 5 Interactive hosts.  I came into this project a bit late so I didn't have a whole lot to do with the overall functionality.  However, I did build most of the forms for collecting visitor information.  I also handled some dynamic content display, etc.",
        "featured": 0,
        "updatedAt": "2008-01-10",
        "url": "http://www.brtrealty.com/",
        "tags": [
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "countryside-rv",
        "title": "Countryside RV",
        "description": "Countryside RV is my first complete Ruby on Rails site.  I was the main programmer for this site while working with Red 5 Interactive.\r\n\r\nOur designer and front end developer took care of most of the design and html build-out.  I was in charge of modeling and building the actual application and admin system.\r\n\r\nThe primary function of the site is to display all of Countryside's current RV inventory.\r\n\r\nCountryside can add a large amount of detail as well as upload multiple photos of a given RV.  We've also implemented a \"Buyers Gallery\" that allows some visible interaction with Countryside's user base.  When someone buys an RV, they'll soon find a photo of themselves and their new camper online.",
        "featured": 0,
        "updatedAt": "2008-01-24",
        "url": "http://csrvsales.com/",
        "tags": [
            "css",
            "html",
            "image-processing",
            "javascript",
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "audit-trail",
        "title": "Audit Trail",
        "description": "The Audit Trail is an internal application that I built for Red 5 interactive.  When we build sites for clients, we like to track any administrative actions that take place.  This way we can track down any problems - accidentally deleted data, security breaches, etc.\r\n\r\nWe were duplicating much of this functionality for several clients, so I whipped out this Audit Trail app.  I've built it so that we can set it up for our clients in 1 of 2 separate ways.  The first, and most commonly used way is for our sites to call the Audit Trail as a service.  This way, most of our clients are hitting the same Audit Trail and we can keep a close eye on what all of our clients are doing.\r\n\r\nThe second way is to install the Audit Trail as a separate app for any given website.  We generally only do this if we anticipate a large amount of logs, or if we have a client with several sites that we're hosting.\r\n\r\nThe app has proven to be very beneficial - our clients really enjoy being able to easily see who's updating what.",
        "featured": 1,
        "updatedAt": "2008-02-28",
        "url": null,
        "tags": [
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "the-bellevue",
        "title": "The Bellevue",
        "description": "The Bellevue is a building located in downtown Philadelphia that houses restaurants, shops, and a hotel.  They hired my company, Red 5 Interactive to build an informational site for them.\r\n\r\nI built a small custom administration section for this site allowing Bellevue to create events and photo galleries.  The photo galleries can be organized and sorted via drag and drop.",
        "featured": 0,
        "updatedAt": "2008-03-01",
        "url": "http://www.bellevuephiladelphia.com/",
        "tags": [
            "css",
            "html",
            "image-processing",
            "javascript",
            "prototype",
            "ruby-on-rails",
            "scriptaculous"
        ],
        "versions": []
    },
    {
        "slug": "team-46",
        "title": "Team 46",
        "description": "Team 46 is a group of service and avionics specialists working at the Des Moines Flying Service (DMFS).  We've been a host for DMFS for years - so they hired us to make a mico-site for their technicians.\r\n\r\nThe Team 46 micro site was pretty straight forward.  They needed a way to blog, manage case studies, take service requests, and upload photos.  For the blug, I simply installed an internal blog plugin that I built.  Everything else was custom programmed.\r\n\r\nThere was nothing crazy about this app, but everything was built and deployed very smoothly.",
        "featured": 0,
        "updatedAt": "2008-03-27",
        "url": "http://www.dmfs.com/team46",
        "tags": [
            "css",
            "html",
            "image-processing",
            "javascript",
            "prototype",
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "glimcher",
        "title": "Glimcher",
        "description": "Glimcher is a premier real estate investment trust that manages malls and shopping centers across the United States.  They came to my company, Red 5 Interactive, seeking a corporate site.\r\n\r\nMy company had already built and launched this site by the time I began working on it, so my job was simply to enhance some features on both the admin and the front-end.\r\n\r\nFirst of all the client wanted a near realtime display of their stock price on the homepage.  I built a script which is ran by a CRON job to scrape a couple quote sites and grab their stock price.  Whenever the price is successfully grabbed I write the data to a local file and use that to display their current price.\r\n\r\nGlimcher also wanted realtime stats on their leasing informational pages, so I added some functionality to display updates on leasable square feet, property count, etc.\r\n\r\nFinally, they wanted to be able to quickly show/hide all dynamic content on their web site.  I added some simple toggling as well as drag/drop sorting to any and all data.",
        "featured": 0,
        "updatedAt": "2008-05-01",
        "url": "http://www.glimcher.com/",
        "tags": [
            "ajax",
            "javascript",
            "prototype",
            "ruby-on-rails",
            "scraping",
            "scriptaculous"
        ],
        "versions": []
    },
    {
        "slug": "justin-marks-racing",
        "title": "Justin Marks Racing",
        "description": "The company I work for, Red 5 Interactive was hired to build a site for NASCAR truck driver, Justin Marks.\r\n\r\nOur basic guideline from the driver was to \"make it like Bam Margera's site.\"  He really enjoyed moving elements, photos, and of course - a music player.\r\n\r\nMy job was to integrate the site with Justin Marks' Flickr account, build XML feeds to power our flash app, and also build a non-flash version of the site.",
        "featured": 0,
        "updatedAt": "2008-05-08",
        "url": "http://www.justinmarksracing.com/",
        "tags": [
            "css",
            "flickr-api",
            "html",
            "javascript",
            "ruby-on-rails",
            "xml"
        ],
        "versions": []
    },
    {
        "slug": "cownie-for-state-house",
        "title": "Cownie For State House",
        "description": "Iowa republican Peter Cownie hired our company to build a promotional web site for him during the 2008 election.\r\n\r\nThe site was a pretty standard, informational site with a blog, and some photos.  Since so many of our sites were having blog-like functionality, I built a Rails blog plugin.  This site was the first site to make use of my blog plugin - which I've called Bee-Log.\r\n\r\nI've also tied the site into Peter's Flickr account for displaying photos on the site.  It was a great excuse to continue playing with the Flickr API.\r\n\r\nP.S. Peter Cownie won",
        "featured": 0,
        "updatedAt": "2008-06-10",
        "url": "http://www.cownieforstatehouse.com/",
        "tags": [
            "flickr-api",
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "adium-status-plugin",
        "title": "Adium Status Plugin",
        "description": "Adium is a multi-protocol chat client for Mac OS X.  I enjoy it because it lets me connect to both AIM and Google Talk.\r\n\r\nShortly after getting Adium I installed the TwitterAdium plugin (or Xtra - as Adium calls it).  The problem with this plugin was that I had too many apps hooked to my Twitter account, therefore I was running into rate limitations with the API.  I had derek.broox.com, Facebook, MySpace, and Adium all hitting my Twitter account, which made Twitter sad.\r\n\r\nSince derek.broox.com grabs and stores my Twitter status, I decided to be nicer to Twitter and write an Adium plugin to grab my status from derek.broox.com.  That is exactly what this plugin does.  \r\n\r\nI built the plugin with Ruby and made it configurable via a YML file.  To get my plugin set up, simply update the url and duration in the included YML file.  After that, just set your Adium status to %_RemoteStatus.  It's as simple as that.  \r\n\r\nNow, all of my Google Talk and AIM contacts can easily follow what I'm doing while I'm on the go.",
        "featured": 1,
        "updatedAt": "2008-07-13",
        "url": null,
        "tags": [
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "keokuk-county-state-bank",
        "title": "Keokuk County State Bank",
        "description": "Keokuk came to us with a redesign in-mind and also wanted the ability to update news and loan rates.  In addition, they wanted to be able to upload and attach photos to news items.\r\n\r\nKeokuk's web site wasn't too programmatically intensive, but it did give me an opportunity to try out some new Rails ideas.\r\n\r\nAround the time of building this app, I found a Rails plugin called ActiveScaffold.  Active Scaffold simply makes a default admin scaffold, and makes it very javascript heavy.  There are lots of AJAX calls and very few page loads.  It was an interesting plugin to try and after a bit of modifying and extending, it seemed to fit the bill for this project.",
        "featured": 0,
        "updatedAt": "2008-07-30",
        "url": "http://www.bankkcsb.com/",
        "tags": [
            "image-processing",
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "itunes-web-remote",
        "title": "iTunes Web Remote",
        "description": "In 2008, I bought a couple Airport Express modules to create an iTunes controlled whole-house-stereo. It was awesome until a terrible song would come on and I'd have to run upstairs to skip to a better tune.\r\n\r\nApple quickly became aware of this problem and released an iTunes remote for iOS. However, at the time I didn't have any iOS devices and I couldn't justify spending a few hundred dollars for a music remote.  As such, I decided to build a remote of my own.\r\n\r\nUsing PHP and AppleScript to communicate to iTunes, I was able to whip up a super light web-based remote that ran on my Mac.  With \"LAMP\" running locally, I could visit the IP of my Mac from any device on my internal network and navigate my songs.\r\n\r\nAt the time I used this to switch songs via my blackberry, sidekick, a PSP, or even our Nintendo Wii.  It was great for parties!",
        "featured": 0,
        "updatedAt": "2008-08-07",
        "url": null,
        "tags": [
            "ajax",
            "applescript",
            "css",
            "html",
            "javascript",
            "php",
            "prototype"
        ],
        "versions": []
    },
    {
        "slug": "signs-plus",
        "title": "Signs Plus",
        "description": "Signs Plus is a Des Moines area company who is responsible for some of Iowa's most impressive signs.\r\n\r\nThey hired my company, Red 5 Interactive, to completely rebuild and rebrand their site.  They wanted something that was loud, colorful, and gets their products right in front of the customer.\r\n\r\nOur designer took care of the visual aspect of the site, while I was in charge of modeling and administration functionality.  \r\n\r\nThe major function of the admin was to allow Signs Plus to upload photos of their work.  The images get dynamically resized in several ways to fit the flash splash page, as well as the rest of the site.\r\n\r\nBeing that the homepage is flash, I also built some basic XML to feed dynamic data to the animation.\r\n\r\nShortly after release, we received emails from the client saying they were already getting new business based on the quality of their new site.",
        "featured": 0,
        "updatedAt": "2008-09-10",
        "url": "http://www.signsplusamerica.com/",
        "tags": [
            "css",
            "html",
            "image-processing",
            "javascript",
            "ruby-on-rails",
            "xml"
        ],
        "versions": []
    },
    {
        "slug": "monroe-marketplace",
        "title": "Monroe Marketplace",
        "description": "Monroe Marketplace is a shopping center located in central Pennsylvania.  Their parent company, PREIT hired us to build a promotional web site during the development of the shopping center.  The site was fairly simple as far as dynamic content was concerned.  \r\n\r\nMy primary tasks were to build a blog, calendar, career, polling, and a job posting system for this application.  Each of these tasks were fairly trivial in that I've done them several times, but it was my first opportunity to write a real poll.  I enjoyed working on the poll quite a lot.",
        "featured": 0,
        "updatedAt": "2008-10-13",
        "url": "http://www.monroe-marketplace.com/",
        "tags": [
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "tmc-transportation",
        "title": "TMC Transportation",
        "description": "TMC, a local trucking company, hired us to rebuild their web site and enhance their web presence.\r\n\r\nI was in charge of modeling and building a system to manage employees, sales reps, and news.  The sales rep data was fed to flash maps via XML.\r\n\r\nThe careers page is built by parsing a remote XML feed.",
        "featured": 0,
        "updatedAt": "2008-12-02",
        "url": "http://www.tmctrans.com/",
        "tags": [
            "javascript",
            "prototype",
            "ruby-on-rails",
            "xml"
        ],
        "versions": []
    },
    {
        "slug": "des-moines-broomball",
        "title": "Des Moines Broomball",
        "description": "I am a broomball player.  Broomball is a sport similar to hockey but a bit more recreational (If you're still curious about the sport, check out the link below).\r\n\r\nOnce my Broomball league caught wind of me being a well connected, tech savvy guy, they nominated me to be the Marketing Director.\r\n\r\nAs marketing director my main purpose was to help promote the league - and what better way to do that than to build a fancy web site.\r\n\r\nNot having hardly any time to devote to this project, I decided to try out a product that I've heard a bit about, called Drupal.\r\n\r\nThe Drupal Content Management System is a great little app.  I literally had a community site up and running within an hour.  The Drupal community has written so many modules, that I didn't have to write a single line of code to get the site off the ground.\r\n\r\nAfter installing a handful of modules, a bit of layout tweaking, and modifying a tiny bit of PHP, we had a completely functional site.\r\n\r\nI even got the help of designer Kathryn Downing to whip up that logo in a matter of about 25 minutes.\r\n\r\nI wouldn't use Drupal for everything, but it was definitely an excellent solution for Des Moines Broomball.  The site has already helped the league gain players and teams for our regional tournaments.",
        "featured": 0,
        "updatedAt": "2009-01-06",
        "url": "http://www.desmoinesbroomball.com/",
        "tags": [
            "css",
            "html",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "napa-sales-driver",
        "title": "NAPA Sales Driver",
        "description": "Edwards Graphics Arts (a partner to NAPA) hired our company to build a web application for distributing posters and flyers to NAPA's retail stores.  Each store can purchase any of several different promotional products.  This is a process that NAPA and it's 3rd party designers had previously handled over the phone.\r\n\r\nI built a web application to help streamline this process and eliminate phone ordering.  This app allows Edwards Graphic Arts to import and edit data for the stores to order.  Retail store managers can then visit the site and order their promotional products.\r\n\r\nThis site is very javascript heavy to provide a quicker user experience.  I've also integrated it with Pay Flow Pro to allow for online payment.",
        "featured": 1,
        "updatedAt": "2009-02-02",
        "url": null,
        "tags": [
            "ajax",
            "e-commerce",
            "javascript",
            "jquery",
            "json",
            "payflow-pro",
            "ruby-on-rails",
            "scraping"
        ],
        "versions": []
    },
    {
        "slug": "siteman",
        "title": "Siteman",
        "description": "SiteMan is a Content Management System that we've written at Red 5 Interactive.  It was originally built so that mall property owners could manage each of their mall property's web sites.  However once we realized how powerful our system was, we decided to generalize the app and use it for everyone.  That way we would have our own internal product that we could keep deploying and improving for all of our clients.\r\n\r\nWe built SiteMan to allow our clients to easily manage a single web site or a group of web sites.  This way a parent company could edit any of their child web sites, while employees of the child companies would only see their respective web site.\r\n\r\nThe front-end of the sites built with SiteMan is also completely extracted from SiteMan itself, which is great for 2 reasons.  First of all, it allows us to more easily keep all of our clients' systems up-to-date in that we're just updating SiteMan and not touching their presentation layer.  Secondly, it also allows us to launch new campaigns and designs for clients very quickly.\r\n\r\nWhen we deploy SiteMan for a client it comes with a core group of tools like user management, webpage editing, file management, audit logs, etc.  From there, custom Tools can be added as plugins.  These tools might include functions like, announcements, events, careers, photo management, stores, social networking, etc.\r\n\r\nWe've also built SiteMan in a way that allows users to customize their tool layout.  They can pick which tools they use the most and arrange them in a way to get a quick snapshot of the exact data they're interested in.  Tools can be added, removed, or sorted at any time - and everything remains just as they left it on their next visit.  \r\n\r\nThis application is very Javascript heavy, making extensive use AJAX, dialog windows, and WYSIWYG editing.  As such, we have minimal page loads which provides a very streamlined experience for our clients.\r\n\r\nI am very proud and excited to have worked with such a great team on this app.  It's so versatile and simple to keep pushing forward.  I can't wait to see where it goes from here.",
        "featured": 1,
        "updatedAt": "2009-02-10",
        "url": null,
        "tags": [
            "ajax",
            "css",
            "html",
            "image-processing",
            "javascript",
            "jquery",
            "json",
            "mysql",
            "prototype",
            "ruby-on-rails",
            "scriptaculous",
            "twitter-api",
            "xml"
        ],
        "versions": []
    },
    {
        "slug": "preit-malls",
        "title": "PREIT Malls",
        "description": "PREIT (Pennsylvania Real Estate Investment Trust) invests in shopping malls in the eastern United States.\r\n\r\nPREIT is one of the primary candidates for our internal CMS project, SiteMan.\r\n\r\nWe've succesfully deployed SiteMan to allow PREIT to manage over 40 of their mall web sites - all from 1 location.\r\n\r\nOne challenge we faced with this project was PREIT's constant seasonal campaigns.  As such, we've built SiteMan so that new presentation packages can easily be added into SiteMan for each of these campaigns.\r\n\r\nWe've also allowed for mobile designs to be appended to each of these presentation packages for easy mobile browsing.",
        "featured": 0,
        "updatedAt": "2009-02-10",
        "url": "http://www.cherryhillmall.com",
        "tags": [
            "ruby-on-rails",
            "siteman"
        ],
        "versions": []
    },
    {
        "slug": "sc-automotive",
        "title": "S & C Automotive",
        "description": "S & C Automotive is a company that provides vehicle warranties and protections to local car dealerships.  If you buy a car from any of several dealerships in Iowa, you'll be offered a set of warranties - paint protection, rust protection, etc.  These protections are all sold to the dealerships by S & C.\r\n\r\nI built a web application to allow S & C to manage these protections and offer them to dealerships.  The dealerships login and submit each protection they sell.  Then, S & C can view, process, ship, and bill for these registrations.",
        "featured": 1,
        "updatedAt": "2009-02-11",
        "url": null,
        "tags": [
            "ajax",
            "css",
            "extjs",
            "html",
            "javascript",
            "json",
            "mysql",
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "site-spider",
        "title": "Site Spider",
        "description": "Site Spider is an internal application that we wrote at Red 5 Interactive.  Its purpose is to crawl an entire website and save everything (pages, stylesheets, javascripts and images) locally.\r\n\r\nWe originally wrote the app when a client's previous web host was unwilling to surrender their files.  It's proven to be a very useful tool.",
        "featured": 0,
        "updatedAt": "2009-03-02",
        "url": null,
        "tags": [
            "ruby-on-rails",
            "scraping"
        ],
        "versions": []
    },
    {
        "slug": "ftthcap-conference",
        "title": "FTTHCAP Conference",
        "description": "Fibre To The Home Council Asian Pacific (FTTHCAP) is a non-profit organization aiming to promote and accelerate Fibre To The Home - obviously in the Asian Pacific.  FTTHCAP hired our company to build an easily manageable site to help promote and provide information on their 4th annual conference.\r\n\r\nOnce the design had been built out, my job was to stick everything into our internal CMS application, SiteMan, and get it deployed ASAP.\r\n\r\nThis was our first installment of SiteMan on a single site system, so it was a great trial run.  Despite a couple \"gotchas\", I was able to push this site out with our SiteMan CMS very rapidly.  During this launch I was able to fix any loose-ends I found in SiteMan, thus enhancing our internal application even further.\r\n\r\nNow, FTTH is able to easily edit any and all content via WYSIWYG editors.",
        "featured": 0,
        "updatedAt": "2009-03-04",
        "url": "http://www.ftthcouncilap-melbourne09.org/",
        "tags": [
            "ruby-on-rails",
            "siteman"
        ],
        "versions": []
    },
    {
        "slug": "michael-annett",
        "title": "Michael Annett",
        "description": "Michael Annett is an upcoming race car driver from Des Moines, IA.  We didn't build his site from scratch, but when his site development/hosting company stopped providing good service, we were asked to take over.  The former host of michaelannett.com was not very cooperative in the site transition - so we had an interesting time getting Michael's content for him.\r\n\r\nTo get Michael's site, we wrote an internal app called <a href=\"http://www.broox.com/work/project/site-spider\">Site Spider</a> to crawl his existing site, save all the pages, their images, stylesheets, javascripts, etc - all while preserving the links and folder structure.  Once I successfully crawled and downloaded this site, I put this app into our internal Content Management application, http://www.broox.com/work/project/siteman\">SiteMan</a>.\r\n\r\nI also built a couple custom SiteMan plugins, which included photo gallery and online store management.\r\n\r\nThe store they wanted was fairly small, however, no matter the size, building an online store is quite an effort.\r\n\r\nNow, Michael is able to easily update news, photo galleries, results, schedules, general webpage content at anytime, and can sell gear online.",
        "featured": 0,
        "updatedAt": "2009-03-09",
        "url": "http://www.michaelannett.com/",
        "tags": [
            "authorize-net",
            "css",
            "e-commerce",
            "html",
            "image-processing",
            "javascript",
            "ruby-on-rails",
            "siteman"
        ],
        "versions": []
    },
    {
        "slug": "loffredo-fresh-produce",
        "title": "Loffredo Fresh Produce",
        "description": "Loffredo is a high-end produce company serving much of the Mid West.\r\n\r\nWhen our company was hired to rebuild their site, my assignments were to integrate our in-house SiteMan CMS, create some plugins, build in a fancy javascript fruit carousel, and of course deploy the site to our production server.\r\n\r\nThe plugin I built for this site simply allowed Loffredo to manage branches and employees and allow site visitors to contact them.\r\n\r\nThe fruit carousel I mentioned is a custom javascript animation that cycles through various fruits on the homepage.",
        "featured": 0,
        "updatedAt": "2009-05-13",
        "url": "http://www.loffredo.com/",
        "tags": [
            "ajax",
            "javascript",
            "prototype",
            "ruby-on-rails",
            "scriptaculous",
            "siteman"
        ],
        "versions": []
    },
    {
        "slug": "iowa-alcoholic-beverages-division",
        "title": "Iowa Alcoholic Beverages Division",
        "description": "Iowa Alcoholic Beverages Division is responsible for the regulation and control of all alcohol and tobacco in the state of Iowa.  The division has generated hundreds of millions of dollars for the state of Iowa.\r\n\r\nOur company has hosted IABD for years.  Up until recently, they were one of the very last Java based sites running on an ancient server stuck in a closet in the back of our office.  As time went on, it became scarier and scarier to let their site remain live.  Once showing IABD the server they were running on, talking them into a complete rebuild was no challenge at all.\r\n\r\nThe scariest part of this rebuild was the task of importing all of the content they had.  I heavily modified our internal Site Spider to accomplish this task.  The client had around 400 pages and 700 files that were linked to (mostly PDF press releases).  I had to completely crawl their site, import everything into our CMS and fix every link to work correctly.  Given the fact that they had FTP access on the old server, this was not a simple task.  I'm talking about some serious site scraping madness!\r\n\r\nBeing such a large site, this client came up with all kinds of awesome ideas for our CMS, which I was able to add-on and commit back to the repository for our other clients.\r\n\r\nSo after setting up our internal CMS and importing their hundreds of pages/files, I had to build a Javascript Fund counter to display on their homepage.  Basically, the client takes their projected income, enters it into a custom tool (that I built) in SiteMan, and my JS does the math to determine how much money is being transfered to the state every second.  It then dynamically animates a count-<i>up</i> on the homepage.\r\n\r\nWhile we're on the JS path.  I also had to build some fancy custom (and totally dynamic) dropdown navigation.\r\n\r\nFinally, I had to model and build a custom Uploader plugin that would allow IABD to import CSV files of their alcohol products, stores, and tobacco compliance data.  Then I built functionality to browse and search all of this data on the front-end.  Again, dealing with thousands of records of data.\r\n\r\nIowa Alcoholic Beverages Division was basically a test of all my skills.  Sys admin, back-end development, front-end development, scraping, importing, and finally deployment.",
        "featured": 0,
        "updatedAt": "2009-07-29",
        "url": "http://www.iowaabd.com/",
        "tags": [
            "ajax",
            "javascript",
            "prototype",
            "ruby-on-rails",
            "scraping",
            "siteman"
        ],
        "versions": []
    },
    {
        "slug": "west-bank",
        "title": "West Bank",
        "description": "West Bank is an Iowa based bank that my company has working with for years.\r\n\r\nWhen they came to us for a redesign, my assignments were to integrate our in-house CMS, build a couple plugins, and build functionality to capture a user's zipcode and display the appropriate location-based content.\r\n\r\nThe plugins I built were based on previous functionality they had and wanted to retain: current loan/savings rates, alerts, and custom newsletters.",
        "featured": 0,
        "updatedAt": "2009-08-11",
        "url": "http://www.westbankiowa.com/",
        "tags": [
            "ajax",
            "javascript",
            "prototype",
            "ruby-on-rails",
            "siteman"
        ],
        "versions": []
    },
    {
        "slug": "derek-broox-com",
        "title": "derek.broox.com",
        "description": "derek.broox.com is my general \"home page\" and development playground. Its primary purpose is to catalog my life and allow me to play with various APIs. I'd like to also think that it helps keep family and friends updated on my life, but there are enough other social networks for that these days. derek.broox.com hosts thousands of photos, videos, maps, status updates, blogs, and various other stories from my entire life.\r\n\r\nderek.broox.com interfaces with Twitter, Facebook, Flickr, Foursquare, Google Latitude, Google maps, Last.fm, Withings, etc. It's also been known to hook into various other extinct APIs like Brightkite.\r\n\r\nEven without major distinction between the versions, this is a constantly evolving web application.",
        "featured": 1,
        "updatedAt": "2009-09-02",
        "url": "http://derek.broox.com",
        "tags": [
            "ajax",
            "brightkite-api",
            "css",
            "facebook-api",
            "flickr-api",
            "google-maps-api",
            "graphic-design",
            "html",
            "image-processing",
            "javascript",
            "json",
            "mysql",
            "php",
            "prototype",
            "scriptaculous",
            "twitter-api",
            "video-production",
            "xml"
        ],
        "versions": [
            {
                "version": "v1",
                "description": "Before I started Broox Extreme, my personal site resided at broox.com.  \r\n\r\nThis was my very first PHP driven personal site and blog.  It was also the home of my first random picture generator which displayed new images on the side each time a page would load.",
                "createdAt": "2001-07-08"
            },
            {
                "version": "v2",
                "description": "Version 2 of derek.broox.com was the first version of my blog on the subdomain: derek.broox.com.  Prior to that my blog resided at www.broox.com.\r\n\r\nThis version was mostly just  content and design changes.  I added some random photo functionality to the site that would load random pictures of me in the homepage header, and random pictures of other things on other pages.  Other than that, not much changed between the first version and this version.",
                "createdAt": "2002-01-09"
            },
            {
                "version": "v3",
                "description": "This version of derek.broox.com was mostly just content and design changes.  I tried to simplify the design a bit while adding much more content, including audio, videos, a biography, and links to my friends' sites.  \r\n\r\nOne cool addition was that on the homepage I made the random photo of myself change to photos of friends when you hovered over links to their web sites.",
                "createdAt": "2003-09-22"
            },
            {
                "version": "v4",
                "description": "This version of derek.broox.com was simply a reason to learn more about design with Cascading Style Sheets.  \r\n\r\nThough this design did include a couple back-end changes, I focused mainly on design.  I definitely accomplished what I set out for in that I learned a great deal about using CSS effectively.\r\n\r\nMajor back-end code additions included tagging and paging for photos.\r\n\r\nThroughout this design's life there were several add-ons made.  Some were back-end changes, most were content changes.",
                "createdAt": "2004-11-05"
            },
            {
                "version": "v5",
                "description": "After working with Truespin Media on several professional sites, I finally felt I gained enough experience to completely rewrite derek.broox.com.  I didn't want to rewrite the site until I was absolutely sure that I was writing extremely solid code that would actually make the site function better - not just look different.\r\n\r\nVisually there isn't a whole lot of difference between this release and version 4, however the back-end was completely rewritten.  \r\n\r\nWith the complete recoding of derek.broox.com I greatly enhanced several features of the site.  A few of the those include: tagging, photo handling, database calls, and paging.  This version of the site is much much lighter, much  quicker, and a lot more clean.",
                "createdAt": "2006-04-18"
            },
            {
                "version": "v6",
                "description": "This version of my site was built to make my blog a bit less prominent and focus more on my internet presence as a whole.\r\n\r\nThis is also where I really began experimenting with geodata and APIs like Flickr, Twitter, Brightkite, Foursquare, and Facebook.",
                "createdAt": "2009-09-02"
            }
        ]
    },
    {
        "slug": "towrate",
        "title": "TowRate",
        "description": "TowRate is a startup that offers a custom service to towing companies.  The site allows subscribed companies to manage assets, map routes, and calculate profit margins for every tow.  It's built in a way that allows the towing companies to quickly run these calculations while on the phone so they can figure out the most profitable way to charge for each tow.\r\n\r\nOn this project, I was in charge of pretty much everything except for the initial design.  My job involved data modeling, loads of calculations, back-end developing, front-end developing, form design, and deployment.\r\n\r\nTowRate is a very javascript heavy application, using plenty of AJAX calls for things like sorting, recalculating rates on the fly, and grabbing map data from the Google Maps API.  The Maps API is used to help determine mileage and time for each tow.  From there, the app uses extensive math and formulas to help find the best price for each call.\r\n\r\nCompanies are able subscribe to TowRate on a monthly or yearly basis.  I integrated PayPal Web Payments Pro to handle these subscriptions; let users join, autorenew, enter discount codes, cancel accounts, etc.\r\n\r\nSubscribed companies can also manage their trucks (as well as truck expenses), users, tow rates, tax areas, routes, etc.  It provides an all around fleet management solution to any towing company.",
        "featured": 1,
        "updatedAt": "2009-10-01",
        "url": "http://www.towrate.com/",
        "tags": [
            "ajax",
            "e-commerce",
            "google-maps-api",
            "javascript",
            "jquery",
            "json",
            "ruby-on-rails",
            "website-payments-pro"
        ],
        "versions": []
    },
    {
        "slug": "countryside-motorsports",
        "title": "Countryside Motorsports",
        "description": "Countryside Motorsports is an interesting little site that I was able to crank out pretty quickly in 2008.  However, we got it done right when our client got super busy, so it sat unlaunched for about a year until we were able to resurrect, update, and launch the site.\r\n\r\nThis is a pretty basic marketing/inventory viewing site for an ATV, Snowmobile dealer in Iowa.  I modeled and built a custom admin for managing inventory, specials, and homepage banners.",
        "featured": 0,
        "updatedAt": "2009-11-24",
        "url": "http://www.countryside-motorsports.com/",
        "tags": [
            "css",
            "html",
            "image-processing",
            "javascript",
            "jquery",
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "letters-to-santa",
        "title": "Letters to Santa",
        "description": "\"Letters to Santa\" is a micro site that we built for participating malls owned by PREIT.\r\n\r\nThe site allowed kids to write letters to Santa and Santa would eventually reply.\r\n\r\nSanta had a handful of random responses that he  sent back to the kids (via CRON job) just before going to bed.\r\n\r\nThis was a fun little microsite to build.  I modeled and handled all of the dynamic functionality, storing the kids' letters, and writing the scripts to help Santa reply in a timely manner.",
        "featured": 0,
        "updatedAt": "2009-11-30",
        "url": null,
        "tags": [
            "ruby-on-rails"
        ],
        "versions": [
            {
                "version": "v1",
                "description": "The first version of this microsite was only used by a few malls, so it was quick and easy to build for Santa.\r\n\r\nSanta was also feeling extra generous in 2008.  In his replies he gave kids a secret password that they could share with their local mall's customer service department for a free cookie from Mrs. Claus.",
                "createdAt": "2008-11-24"
            },
            {
                "version": "v2",
                "description": "The second version of this site supported around 40 malls rather than the few malls it supported the first year.  With that, I was able to clean up and genercize a lot of the code.\r\n\r\nI also changed the email functionality to use the WhatCounts.com API to help Santa send emails back to kids.",
                "createdAt": "2009-11-30"
            }
        ]
    },
    {
        "slug": "holiday-ecards",
        "title": "Holiday eCards",
        "description": "This is a microsite that I built as a marketing tool for malls owned by PREIT.  It allowed people customize and send flash-based cards to friends and family.\r\n\r\nIt's also built so that a campaign can be coupled with a contest. For example all cards sent to moms on mothers day could be eligible for a mall gift card.\r\n\r\nFor delivering the cards, I wrote a small script using the WhatCounts.com API.\r\n\r\nThis little application has been a lot of fun to work on and a huge success for the associated malls.",
        "featured": 0,
        "updatedAt": "2009-11-30",
        "url": null,
        "tags": [
            "ajax",
            "css",
            "html",
            "javascript",
            "prototype",
            "ruby-on-rails",
            "xml"
        ],
        "versions": [
            {
                "version": "v1",
                "description": "The first version of this microsite I built started out as a contest for 3 malls owned by PREIT.  It allowed people to send their mom a customized flash eCard for mother's day.  Each person that sent their mom a card got a free gift from the mall, and their moms had the opportunity to enter a $500 giveaway.  \r\n\r\nFor delivering the cards, I wrote a small script using the WhatCounts.com API to send all of the moms emails on Mothers Day - May 10.\r\n\r\nI had a lot of fun developing this quick, small project and trying out a new API.",
                "createdAt": "2009-04-13"
            },
            {
                "version": "v2",
                "description": "The Holiday eCard microsite was brought back to life for the winter holidays in 2009.  Only this time instead of supporting only 3 malls, it was to support ~40 malls.  That said, there were many performance improvements and genercizing of the codebase.\r\n\r\nThe site was a great success receiving several hundred cards.",
                "createdAt": "2009-11-30"
            }
        ]
    },
    {
        "slug": "mary-mcadams",
        "title": "Mary McAdams",
        "description": "Mary McAdams is a Des Moines area folk artist who is becoming very well known in the area.  Mary hired my friend Mindy Hoskin as her designer - and Mindy approached me to bring her designs to life.\r\n\r\nHaving a small web budget and not a lot of time, I used this opportunity to brush up my WordPress skills.  \r\n\r\nI was able to build Mindy's designs out into a WordPress template and still keep a lot of the custom functionality that Mary wanted.\r\n\r\nAlong with her blog, Mary also wanted a lot of multimedia - photos, video, a music player, show times, downloads, etc.  \r\n\r\nFor photos, I was able to customize one of the many WordPress Flickr plugins to work with Mindy's design.\r\n\r\nShowtimes and the Music player are powered by Mary's ReverbNation account.  To make showtimes work, I hooked her ReverbNation calendar RSS feed to FeedBurner BuzzBoost and embedded the generated BuzzBoost into her blog accordingly.\r\n\r\nCombined with Mary's active social networking, I think we were successful in getting all of her info in front of an audience in an elegant way.",
        "featured": 0,
        "updatedAt": "2009-11-30",
        "url": "http://www.marymcadams.com/",
        "tags": [
            "css",
            "html",
            "mysql",
            "php",
            "wordpress"
        ],
        "versions": []
    },
    {
        "slug": "smithson-woodworks",
        "title": "Smithson Woodworks",
        "description": "Smithson Woodworks is a side project run by my cousin-in-law, Jon Smithson.\r\n\r\nOne year we decided to trade, he'd build me a component rack for my entertainment center, and I'd help him get his stuff online.\r\n\r\nJon sent me a logo and some photos of his work, I helped him by setting a Wordpress site that integrated with a Flickr account.  Jon simply uploads photos to Flickr and creates sets to update the portfolio on SmithsonWoodworks.com.",
        "featured": 0,
        "updatedAt": "2009-12-28",
        "url": "http://www.smithsonwoodworks.com/",
        "tags": [
            "blueprint",
            "css",
            "flickr-api",
            "html",
            "javascript",
            "mysql",
            "php",
            "prototype",
            "wordpress"
        ],
        "versions": []
    },
    {
        "slug": "bix-produce",
        "title": "Bix Produce",
        "description": "Bix Produce is a produce distributor based in Minnesota.  They became interested in my company, Red Five after seeing the produce site we built for Loffredo.\r\n\r\nI was in charge of integrating the design we came up with into our SiteMan CMS, and also deploying the site for Bix.",
        "featured": 0,
        "updatedAt": "2010-01-07",
        "url": "http://www.bixproduce.com/",
        "tags": [
            "prototype",
            "ruby-on-rails",
            "siteman"
        ],
        "versions": []
    },
    {
        "slug": "valley-west-mall",
        "title": "Valley West Mall",
        "description": "Valley West Mall is a long time Red Five client and was sort of a guinea pig to test out the latest version of our SiteMan CMS and brand new javascript/HTML5 based SVG maps.\r\n\r\nRebuilding the Valley West Mall with our new technology was a great learning experience.  We greatly improved our CMS, making things much more efficient and converting to jQuery.  Rendering maps with javascript rather than flash meant they could be viewed on mobile devices.\r\n\r\nIn addition to these great new features, Valley West requested some integration with Twitter.  This allowed me to build a twitter plugin for SiteMan CMS which would allow the mall to easily post tweets as well as monitor mentions or replies.\r\n\r\nI left Red Five before our new HTML5 maps were ever deployed, and unfortunately, at the time of writing this, they are still not in production.",
        "featured": 0,
        "updatedAt": "2010-01-08",
        "url": "http://www.valleywestmall.com/",
        "tags": [
            "ruby-on-rails",
            "siteman",
            "twitter-api"
        ],
        "versions": []
    },
    {
        "slug": "philadelphia-marketplace",
        "title": "Philadelphia Marketplace",
        "description": "Philadelphia Marketplace is the shopping center located within Philadelphia International Airport. They hired Red Five to update their site, give them a content management system and also setup interactive maps for their shopping center.\r\n\r\nThis was a pretty simple project from an engineer perspective - I was in charge of integrating the design into our CMS, writing a bit of javascript for the front-end, and finally, deploying the site.",
        "featured": 0,
        "updatedAt": "2010-01-11",
        "url": "http://www.philamarketplace.com/",
        "tags": [
            "javascript",
            "prototype",
            "ruby-on-rails",
            "siteman"
        ],
        "versions": []
    },
    {
        "slug": "preit-iphone-app",
        "title": "PREIT iPhone App",
        "description": "The PREIT iPhone app was a small, marketing application to promote each of the company's 30-40 shopping malls.\r\n\r\nThe application used your phone's location to find their nearest mall, give information about the mall, store directories, SVG based maps, calendars of events, etc.\r\n\r\nOne other engineer and I converted our Rails based CMS into an API and then built most of the native Objective-C iOS app prior to me leaving the company... at which point a 3rd party contractor finished \"polished\" the application",
        "featured": 0,
        "updatedAt": "2010-02-01",
        "url": "https://itunes.apple.com/us/app/preit-malls/id437846433?mt=8",
        "tags": [
            "ios",
            "objective-c"
        ],
        "versions": []
    },
    {
        "slug": "perficut",
        "title": "Perficut",
        "description": "Perficut is one of the leading landscaping and lawn service companies in Des Moines, IA.  They came to our company, Red Five seeking a more serious web presence along with some custom tools.\r\n\r\nAlong with a complete redesign built around our CMS, I also built a large custom irrigation and service scheduler for Perficut and their clients.\r\n\r\nThis scheduler allows Perficut to define a season, average appointment times, the number of crews available, which neighborhoods are serviced, and other small details.  From here, the tool allows Perficut to assign certain crews to certain neighborhoods (based on stats from the previous season).  Once this is all setup, customers can visit Perficut's site to schedule sprinkler system startups, shutdowns, and service.\r\n\r\nOn top of this custom tool, I was also in charge of integrating this site into our SiteMan CMS and deploying the site.",
        "featured": 0,
        "updatedAt": "2010-02-17",
        "url": "http://www.perficut.com/",
        "tags": [
            "javascript",
            "jquery",
            "ruby-on-rails",
            "siteman"
        ],
        "versions": []
    },
    {
        "slug": "harper-soundboard",
        "title": "Harper Soundboard",
        "description": "A couple years ago, my friend Harper Reed figured out a way to hack into my phone (from a couple hundred miles away) and change my voicemail... and at the time of writing this app - I still haven't changed it.  So when Harper asked me to make an Android app for a little contest, I thought, what could be better than a soundboard about hacking phones?\r\n\r\nSo here's my app... it's pretty dumb, but it was a great intro to Android development.  Plus I got to brush up on some Java.\r\n\r\nI published this app in the Android market (as a free app of course).  Within the first week I had around 250 downloads, about 60% of which uninstalled the application shortly after playing with it.  However, I did have 10 ratings with an average rating of 4.5 stars... they were all my friends I'm sure.",
        "featured": 0,
        "updatedAt": "2010-02-26",
        "url": null,
        "tags": [
            "android",
            "graphic-design",
            "java"
        ],
        "versions": []
    },
    {
        "slug": "dipity",
        "title": "Dipity",
        "description": "In short, Dipity is a digital timeline web application with a hint of social networking.\r\n\r\nWe have built an incredible web-based tool that allows users to create, share, embed and collaborate on timelines that integrate video, audio, images, text, social media, geolocation and timestamps.  Timeline viewers can also pan around and zoom into these timelines for a very nice, visually engaging experience.",
        "featured": 1,
        "updatedAt": "2010-09-25",
        "url": "http://www.dipity.com",
        "tags": [
            "ajax",
            "css",
            "facebook-api",
            "flickr-api",
            "google-maps-api",
            "html",
            "javascript",
            "jquery",
            "json",
            "mysql",
            "php"
        ],
        "versions": [
            {
                "version": "v2",
                "description": "Dipity was originally a Facebook app.  Version 2 was its reincarnation as a full fledged web application.  It was a very impressive piece of software at the time and a huge feat to get it built. Unfortunately, I have nothing to do with any of those things...  I was actually hired at Dipity to help phase out Dipity 2 and reinvent the software.\r\n\r\nDuring the building of Dipity 3, things on Dipity 2 obviously needed maintained.  Most of my work on 2.0 was related to bug fixes, client support, updating ad providers, or updating the widget to support new video players and sources.",
                "createdAt": "2010-01-01"
            },
            {
                "version": "v3",
                "description": "Building Dipity 3 is the main reason I was hired on at Dipity.\r\n\r\nVersion 2 was a couple years old.  The design was dated, its timeline widget was built on the YUI library, and was generally inefficient.\r\n\r\nDipity 3's goal was to update the look, improve the widget's efficiency, support HTML5 guidelines, function on mobile devices, and provide several new features.\r\n\r\nI built the front-end from the ground up, added several new features in both the front and back end (including Facebook connect, better registration process, etc), and worked closely with our other part-time engineer on the completely rewritten javascript timeline widget.\r\n\r\nI spent a lot of time making sure this new Dipity timeline widget works on mobile devices such as androids, iPhones, and iPads.",
                "createdAt": "2010-09-25"
            }
        ]
    },
    {
        "slug": "des-moines-alive",
        "title": "Des Moines Alive",
        "description": "Des Moines Alive is a personal project that my friend Nick Leeper and I built to help Des Moines Area people find awesome local bars and restaurants places. In addition to general merchant info, we provide users with aggregated data such as reviews, foursquare tips, merchant tweets, etc.\r\n\r\nWe designed Des Moines Alive to be very lite and easy to navigate. The goal is to provide our visitors with the information they need as quickly as possible.",
        "featured": 1,
        "updatedAt": "2011-04-30",
        "url": "http://www.desmoinesalive.com",
        "tags": [
            "ajax",
            "css",
            "facebook-api",
            "foursquare-api",
            "google-maps-api",
            "html",
            "image-processing",
            "javascript",
            "jquery",
            "json",
            "mysql",
            "php",
            "simple-geo-api",
            "twitter-api"
        ],
        "versions": [
            {
                "version": "v1",
                "description": "Des Moines Alive is a personal project that Nick Leeper and I developed to help Des Moines Area people find new and cool places to go. We focus primarily on restaurants and bars but we also give information on local sports and recreation. One of the best features is that the site allows visitors to review any of the locations listed.\r\n\r\nWe designed Des Moines Alive to be very lite and easy to navigate. The goal is to provide our visitors with the information they need as quickly as possible.\r\n\r\nAt only a year old the site is getting 2,000 - 3,000 hits per day and has had over 650 reviews submitted. Des Moines Alive has also been featured in local print media.",
                "createdAt": "2005-04-01"
            },
            {
                "version": "v2",
                "description": "Nick and I decided to use this version of Des Moines Alive to learn new things, play with APIs, and really switch our focus to local merchants.\r\n\r\nWe built our own custom PHP MVC, with ideas borrowed from our experiences with Rails and Kohana. We redesigned our database to be more efficient. We also began using many more APIs such as simpleGeo, Google Maps, Facebook, Foursquare, and Twitter to aggregate data and give our users more information.",
                "createdAt": "2011-04-30"
            }
        ]
    },
    {
        "slug": "vocalfi",
        "title": "VocalFi",
        "description": "VocalFi is a telecommunication service that offers web-based conference services. Much of the application seemed to be built by young contractors using the Cake PHP MVC framework. \r\n\r\nI was later hired as a short-term contractor to make the application cacheable via MemCache. This entailed a lot of code abstraction and heavy cleanup to reduce the incredible amount of code duplication. Once that was done, we were able to easily add meaningful caching.",
        "featured": 0,
        "updatedAt": "2011-06-08",
        "url": "http://www.vocalfi.com/",
        "tags": [
            "object-oriented",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "debate-quotes",
        "title": "Debate Quotes",
        "description": "Debate Quotes was my first assignment after joining Obama for America, and my re-introduction to Rails after not using it in over a year.\r\n\r\nIt was built to keep track of, call out, and fact check quotes during the early Republican debates.\r\n\r\nTechnically it was a basic CRUD Rails application that exposed both normal views and a JSON based API for use by the front-end.\r\n\r\nWe had this application in production 72 hours after I joined the campaign and iterated on it for another debate a few weeks later.",
        "featured": 0,
        "updatedAt": "2011-09-07",
        "url": null,
        "tags": [
            "mysql",
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "tweet-your-rep",
        "title": "Tweet your Rep",
        "description": "Tweet Your Rep was a simple application that allowed supporters to post tweets to their state representatives based on current issues. It allowed Obama For America to create a promotional campaign, select the chambers and parties to target, and then add some pre-built tweets templates.\r\n\r\nI architected and built the API layer and basic CMS as well as integrated it with the Twitter and Sunlight Labs Congress APIs.",
        "featured": 0,
        "updatedAt": "2011-10-20",
        "url": null,
        "tags": [
            "mysql",
            "ruby-on-rails",
            "twitter-api"
        ],
        "versions": []
    },
    {
        "slug": "artworks",
        "title": "Artworks",
        "description": "Artworks was a web application that allowed Obama supporters to vote on items in a contest. It was primarily used for promotional poster competitions. This app was built in PHP using the Kohana PHP framework.\r\n\r\nI worked on some of the core functionality of this application as well as built the basic CMS. I also integrated it with Facebook's Open Graph API to allow users to login to vote as well as publish custom open graph actions to their timeline. Unfortunately we this launched before Facebook's custom actions had even publicly launched, so we didn't get to use that portion of the app.",
        "featured": 0,
        "updatedAt": "2011-11-06",
        "url": null,
        "tags": [
            "facebook-api",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "debate-watch",
        "title": "Debate Watch",
        "description": "Debate Watch was a web application loosely based on Planned Parenthood's \"Pledge a Protestor\" program. The basic idea is that you make your opposition pay for negative actions by allowing your supporters to pledge money each time the opposition attempts slander.\r\n\r\nWith Debate Watch, we took some of the Republican candidates' favorite demeaning terms and promoted them on our site along with some fact checking. Obama supporters could then pledge to donate a certain amount of money each time a given word was said during the debate, and of course put a max cap on their donation in case something got out of control.\r\n\r\nWe had a team of word trackers stuffed in a room listening to the debate and tallying the terms in real-time. On the web site's front-end the words would then re-arrange and scale in real-time as our pledgers watched.\r\n\r\nI built the entire back-end of the application along with the word tracker and a small JSON API for consumption by our front-end team.\r\n\r\nThis application was built primarily as an experiment to test some of our scaling and payment infrastructure but managed to be quite fun and also earned us tens of thousands of dollars early on.",
        "featured": 0,
        "updatedAt": "2011-12-05",
        "url": null,
        "tags": [
            "mysql",
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "narwhal",
        "title": "Narwhal",
        "description": "Narwhal was the famous technology infrastructure behind Barack Obama's 2012 Re-election campaign. It was a Python-based interface and integration layer that allowed us to unify the disconnected pieces of what we knew about voters, volunteers, event-goers, voting locations, etc. I was one of the top 5 contributors to the Narwhal project.\r\n\r\nThe integration side was a small web layer that handled syncing data with our vendors in realtime. Incoming data was saved to a local database and then became queued via SQS for translation and loading (by our integration workers) into the Narwhal interface layer. Here I extended existing integrations and built some parts to sync voter applicant and precinct data.\r\n\r\nThe interface side allowed us to use this unified data to quickly build dozens of client applications for various tasks across the campaign. I spent most of my time in Narwhal building and extending models and endpoints to support client application needs. The pieces I worked on helped support pollster surveys, phone canvassing, volunteer organizing, image processing, voting location lookup, incident tracking, etc.\r\n\r\nI also built a thin Ruby Gem that allowed our ruby based client applications to quickly and easily interface with the Narwhal API.",
        "featured": 1,
        "updatedAt": "2012-11-06",
        "url": null,
        "tags": [
            "image-processing",
            "json",
            "mysql",
            "python"
        ],
        "versions": []
    },
    {
        "slug": "voting-location-lookup",
        "title": "Voting Location Lookup",
        "description": "The 2012 Obama Re-election campaign was a firm believer in that the more voters who turn-out to vote the more likely Democrats are to win the election. With that, the campaign put a huge effort into cataloguing voting locations and making sure voters had the tools they needed to find these locations.\r\n\r\nAs the lead engineer of voter contact I architected and built the data layers, integration tools, and APIs to allow client applications to get at the data. As such I worked very closely with our data team, the DNC, voting location experts across the campaign, and our front-end team.\r\n\r\nDespite the incredible challenges that came with the constantly evolving, incomplete/disorganized data and different laws/rules in each state we built a comprehensive, nation-wide election day lookup tool. In addition to that, we built the ever first nation-wide \"early vote\" lookup tools.\r\n\r\nNot only was this data available via online lookup tools, it also integrated with DNC applications and allowed our phone canvassing applications to automatically display relevant voting locations for the canvassed voter.",
        "featured": 0,
        "updatedAt": "2012-11-06",
        "url": null,
        "tags": [
            "json",
            "mysql",
            "python",
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "call-tool",
        "title": "Call Tool",
        "description": "Call Tool is a phone canvassing web application used by both Obama for America and the DNC. In its simplest form, it provides volunteers with a relevant script to read and a voter to Call. The volunteer records the answers of the voter, which are used to learn more about how the campaign should be operating or targeting individuals.\r\n\r\nUnderneath its shell Call Tool had a fairly complex architecture that proxied all of its data through our Narwhal API and interfaced with a Voter Checkout Service API and synced with 2 of the campaign's vendors.\r\n\r\nI architected and built the Call Tool web application and its communication with Narwhal API from the ground up. I also extended several parts of the Voter Checkout Service to make it more performant, tighten protection against fraudulent callers, and better integrate with our vendors. As I took on other tasks on the campaign, I worked with other engineers and oversaw all development on the application.",
        "featured": 0,
        "updatedAt": "2012-11-06",
        "url": null,
        "tags": [
            "facebook-api",
            "javascript",
            "jquery",
            "json",
            "mysql",
            "python",
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "voter-registration-saas",
        "title": "Voter Registration SaaS",
        "description": "Voter Registration SaaS was a thin, skinnable, multi-lingual, voter registration web application built on top of the DNC's Voter Registration API. This app lived in several places - most notably at the hilariously named gottaregister.com, which was mentioned by President Obama in several speeches, on television, within social media and even on reddit.\r\n\r\nIn most states, this application basically acted as a fancy PDF filler that the user could print and mail in. However, it also allowed us to capture their voter information so that we could follow up and target that potential voter in the future.\r\n\r\nI inherited this application early-on and was in charge of making sure it was both stable and scalable while overseeing implementation of the campaign's evolving feature requests. It was one of the most interesting applications to scale because it rarely received organic traffic. It would get absolutely slammed when the president or some celebrity mentioned or linked to the application in speeches, on air, or in social media.\r\n\r\nThis was addressed by extensive caching, limiting dynamic content on landing pages, and queueing API requests in the event of API downtime or slowness. The queueing backup that I implemented (using Amazon's SQS) saved us thousands of voter registrations alone.\r\n\r\nWe also made this application embeddable and eventually open sourced the core of it.",
        "featured": 0,
        "updatedAt": "2012-11-06",
        "url": null,
        "tags": [
            "facebook-api",
            "ruby-on-rails"
        ],
        "versions": []
    },
    {
        "slug": "carfiend-api",
        "title": "Carfiend API",
        "description": "Carfiend is a mobile application built for car enthusiasts to share photos of both their own cars and cars in the wild.\r\n\r\nA couple friends and I were hired to build the backing API for the project. We built it in Python using Flask and SQLAlchemy.\r\n\r\nI built many of the endpoints and models for interacting with cars, photos, events, other users, search, etc.",
        "featured": 0,
        "updatedAt": "2013-03-01",
        "url": "http://www.carfiend.com/",
        "tags": [
            "image-processing",
            "json",
            "mysql",
            "python"
        ],
        "versions": []
    },
    {
        "slug": "simple-auto-service",
        "title": "Simple Auto Service",
        "description": "In the early 2000s, I often found myself at a mechanic or auto-parts store needing to know the last time I performed a certain service on my vehicles. So I whipped up a tiny web-app to help track and display this information. A decade later I became bored while traveling so I decided to clean up the old app and publish the code.\r\n\r\nIt's a super simple PHP/MySQL CRUD application based off of an ORM and Model framework that I built after learning Rails in 2008. The app itself barely has any features but I published the code publicly to show some friends my simple PHP framework.",
        "featured": 0,
        "updatedAt": "2013-03-28",
        "url": "https://github.com/broox/simple-auto-service",
        "tags": [
            "css",
            "html",
            "mysql",
            "php"
        ],
        "versions": []
    },
    {
        "slug": "modest-ios-store",
        "title": "Modest iOS Store",
        "description": "",
        "featured": 0,
        "updatedAt": "2014-11-01",
        "url": null,
        "tags": [
            "e-commerce",
            "objective-c"
        ],
        "versions": []
    },
    {
        "slug": "modest-web-client",
        "title": "Modest Web Store",
        "description": "",
        "featured": 0,
        "updatedAt": "2014-12-31",
        "url": null,
        "tags": [
            "backbone-js",
            "css",
            "e-commerce",
            "html",
            "javascript",
            "jquery",
            "node-js"
        ],
        "versions": []
    },
    {
        "slug": "commerce-api",
        "title": "Commerce API",
        "description": "",
        "featured": 0,
        "updatedAt": "2015-04-13",
        "url": null,
        "tags": [
            "e-commerce",
            "python"
        ],
        "versions": []
    },
    {
        "slug": "modest-control-panel",
        "title": "Modest Control Panel",
        "description": "",
        "featured": 0,
        "updatedAt": "2015-04-13",
        "url": "https://panel.modest.com/",
        "tags": [
            "css",
            "e-commerce",
            "html",
            "javascript",
            "jquery",
            "python"
        ],
        "versions": []
    }
]