[
    {
        "slug": "ajax",
        "name": "AJAX",
        "description": "I've used asynchronous request patterns extensively through my years in web development. I was actually writing \"AJAX\" code before (and after) asynchronous web requests were even called AJAX."
    },
    {
        "slug": "api-design",
        "name": "API Design",
        "description": "I've been designing APIs nearly as long as I've been consuming them. I find API design to be very fun and always like collaborating with my API consumers to ensure that we're implementing interfaces in a sane fashion."
    },
    {
        "slug": "android",
        "name": "Android",
        "description": ""
    },
    {
        "slug": "applescript",
        "name": "AppleScript",
        "description": ""
    },
    {
        "slug": "authorize-net",
        "name": "Authorize.Net",
        "description": "I haven't deployed many web applications with Authorize.Net, but I'm no stranger to payment gateways.\n\nFeel free to check out some of my other <a href=\"/tags/e-commerce\">e-commerce applications</a>."
    },
    {
        "slug": "backbone-js",
        "name": "Backbone.js",
        "description": ""
    },
    {
        "slug": "blueprint",
        "name": "Blueprint",
        "description": "Blueprint is a small CSS framework that helps speed up front-end styling development.  I'm not a huge fan of spending lots of time getting my html/css pixel perfect, so I decided to give this a test drive."
    },
    {
        "slug": "brightkite-api",
        "name": "BrightKite API",
        "description": "I used the old BrightKite API to gather data and sync my check-ins and notes up with my tweets, and facebook statuses in my local database.  Combined with Google Latitude, I also used the API to display my latest location and daily travels on my personal site."
    },
    {
        "slug": "cloudevents",
        "name": "Cloudevents",
        "description": "I spent some time publishing and consuming cloudevents while building consistent event messages between PayPal and Venmo."
    },
    {
        "slug": "css",
        "name": "CSS",
        "description": "Front-end styling isn't my expertise, but I've had no choice but to become proficient in cross-browser and responsive styling over my years of web development. I've built applications with Sass, less, raw CSS, and various other styling frameworks."
    },
    {
        "slug": "docker",
        "name": "Docker",
        "description": "From my personal personal projects to professional ones, I've containerized many applications with Docker to make development and deployment a breeze."
    },
    {
        "slug": "dynamodb",
        "name": "DynamoDB",
        "description": ""
    },
    {
        "slug": "e-commerce",
        "name": "E-Commerce",
        "description": "I've built plenty of sites that have handled some form of online payment - whether it's for goods, subscriptions, or events.\n\nThe payment gateways I've used are <a href=\"/tags/authorize-net\">Authorize.net</a>, Braintree, Stripe, <a href=\"/tags/paypal\">PayPal</a> (including Paypal's <a href=\"/tags/website-payments-pro\">Website Payments Pro</a> and <a href=\"/tags/payflow-pro\">Payflow Pro</a>)"
    },
    {
        "slug": "extjs",
        "name": "ExtJS",
        "description": "Though I don't have much to show for it in my portfolio, I've used ExtJS quite a lot. During part of my time at Pioneer Hi-Bred, it was the preferred javascript framework for developing internal tools.\n\nExtJS is a very specialized framework. I find it doesn't fit most people's needs but it's been great for data-collection applications."
    },
    {
        "slug": "facebook-api",
        "name": "Facebook API",
        "description": "I've used the Facebook API to do a bit of tinkering on my personal website and also to allow website users to easily integrate and create accounts via Facebook connect."
    },
    {
        "slug": "flash",
        "name": "Flash",
        "description": "I started using flash to add simple animations to soem of my early web projects. It was pretty clunky, but got the job done... Thankfully, it's been replaced by modern javascript."
    },
    {
        "slug": "flickr-api",
        "name": "Flickr API",
        "description": "Flickr is one of the first APIs that I really dove into with my personal develoment projects. I've used it for syncing, uploading, downloading, tagging, and even geotagging photos on Flickr.com.\n\nI love using the Flickr API simply because it acts as a nice backup of photos. Plus, they provide some nice organization tools."
    },
    {
        "slug": "foursquare-api",
        "name": "Foursquare API",
        "description": "I've spent a lot of time playing with the Foursquare API. For some personal projects I use it to help track where I am and display that information for curious family and friends.\n\nI've also used it to pull tips for bars and restaurants on my \"alive\" sites."
    },
    {
        "slug": "google-maps-api",
        "name": "Google Maps API",
        "description": "I've used the Google Maps API primarily to display the coordinates of geotagged data and also to track trips."
    },
    {
        "slug": "graphic-design",
        "name": "Graphic Design",
        "description": "I'm a much better programmer than I am designer, but I do enjoy really doing some design from time-to-time."
    },
    {
        "slug": "html",
        "name": "HTML",
        "description": "How can you be a web developer and not know HTML?  I started learning HTML in 1999 and simply haven't been able to escape it since.\n\nI do very little HTML on some of my projects, but here are some of the projects I've done extensive HTML work on."
    },
    {
        "slug": "image-processing",
        "name": "Image Processing",
        "description": "I've done image processing and manipulation with several libraries including GD, Image Magick, Image Science, PIL - everything from cropping, and resizing to appending watermarks and rotating based on EXIF information."
    },
    {
        "slug": "ios",
        "name": "iOS",
        "description": ""
    },
    {
        "slug": "java",
        "name": "Java",
        "description": "I've been in and out of Java programming for years.  I studied heavily while at Cornell College and wrote a lot of it while at my first full-time job, Pioneer.  \n\nI don't use it often today, but I've had to dive back in for debugging old projects or for various mobile development."
    },
    {
        "slug": "javascript",
        "name": "JavaScript",
        "description": "I've done extensive JavaScript work over the years. From the client-side to server-side and from popular frameworks to thousands of lines of custom libraries.\n\nSome of the frameworks I've most used include: Express, <a href=\"/tags/extjs\">ExtJS</a>, <a href=\"/tags/jquery\">jQuery</a>, <a href=\"/tags/nuxt\">Nuxt</a>, <a href=\"/tags/prototype\">Prototype</a>, <a href=\"/tags/scriptaculous\">Scriptaculous</a>, SproutCore, <a href=\"/tags/vue\">Vue</a> and a handful of custom in-house frameworks."
    },
    {
        "slug": "jquery",
        "name": "jQuery",
        "description": "jQuery used to feel like magic. I used it so much to quickly develop cross-browser compatible web applications before standards became better and other reactive frameworks came about."
    },
    {
        "slug": "json",
        "name": "JSON",
        "description": "My data-interchange and Document datastore format of choice. It's not my favorite for configuration, but it gets the job done. I was very glad to see JSON replace XML."
    },
    {
        "slug": "mapbox",
        "name": "Mapbox API",
        "description": "I started using Mapbox in place of Google Maps APIs for personal projects just because it seemd more more fun, friendlier, and cheaper. I mostly use this for displaying maps of my travels and geocoding my geotagged data."
    },
    {
        "slug": "mysql",
        "name": "MySQL",
        "description": "Lately, I've been spoiled by a lot of ORMs like ActiveRecord, SQLAlchemy, Sequelize, etc.\n\nAs such, I haven't been writing as much SQL as I used to... but every once in a while, writing a plain query can be quicker (and easier to manage) than figuring out how to wrangle the ORMs to get the data I need."
    },
    {
        "slug": "mongo",
        "name": "Mongo",
        "description": "I've used Mongo as a document store for various projects like mirroring/caching API response data."
    },
    {
        "slug": "node-js",
        "name": "Node.js",
        "description": "Whether it was with Nuxt or the express.js apps/APIs that I've hacked on... I've gotten to write quite a few lines of server side JS with Node."
    },
    {
        "slug": "nuxt",
        "name": "Nuxt.js",
        "description": "I discovered Nuxt when I was looking to rebuild my personal website as a single page, performant application that still had server side rendering and good SEO. I've absolutely loved tinkering with Nuxt."
    },
    {
        "slug": "objective-c",
        "name": "Objective-C",
        "description": "I went through some iOS and objective-C training in 2009 and got to use it to develop a couple small mobile applications before it was replaced by Swift."
    },
    {
        "slug": "payflow-pro",
        "name": "Payflow Pro",
        "description": "PayFlow Pro is a payment gateway offered by PayPal. Even though it's owned by PayPal, it's a true gateway in that it's unbranded and does not require the end-user to have a PayPal account.\n\nI've only had the opportunity to use PayFlow Pro one time but I must say I was quite impressed.\n\nFeel free to check out some of my other <a href=\"/tags/e-commerce\">e-commerce applications</a>."
    },
    {
        "slug": "paypal",
        "name": "PayPal",
        "description": "I tend to prefer payment gateways over using PayPal, but their API has been useful for quick projects that need simple payment processing.\n\nFeel free to check out some of my other <a href=\"/tags/e-commerce\">e-commerce applications</a>."
    },
    {
        "slug": "perl",
        "name": "Perl",
        "description": ""
    },
    {
        "slug": "php",
        "name": "PHP",
        "description": "I spent a solid 13 years writing PHP web applications, but have moved away from it after being introduced to Ruby on Rails, Python, and modern Javascript.\n\nPeople always discounted PHP for being a scripting language, but I always argued that using object oriented principles, a good programmer can easily make a beautiful PHP application. PHP was still powerful, fast, well documented, and had a great support community."
    },
    {
        "slug": "prototype",
        "name": "Prototype",
        "description": "I haven't used it in many years, but Prototype was one of the first javascript frameworks that I learned - and like most people, it blew my mind.  I couldn't believe how simple and concise javascript could be."
    },
    {
        "slug": "python",
        "name": "Python",
        "description": "After reading the Zen of Python, Python quickly became my server-side and scripting language of choice. It's readable, concise, and easy to get rolling with - especially when paired with the tons of lightweight frameworks and libraries that are available."
    },
    {
        "slug": "ruby-on-rails",
        "name": "Ruby on Rails",
        "description": "I started programming with Ruby on Rails in 2007. It was really my first time being forced into using MVC principles and it was one of the best things that has happened to me as a programmer.\n\nThe way that Ruby on Rails pushes good development principles really strengthened me.  Since starting with Rails, even my PHP apps became much cleaner and more concise."
    },
    {
        "slug": "scraping",
        "name": "Scraping",
        "description": "Though I don't have a whole lot to show for it in my portfolio I've done quite a bit of scraping.  Everything from web page scraping to scraping poorly formatted CSV exports."
    },
    {
        "slug": "scriptaculous",
        "name": "script.aculo.us",
        "description": "script.aculo.us is another one of those Javascript frameworks that just blew my mind the first time I used it.\n\nI've used script.aculo.us just about like everyone else - to add fancy animated effects to web applications."
    },
    {
        "slug": "simple-geo-api",
        "name": "Simple Geo API",
        "description": "Simple Geo was a great location infrastructure API that I used in a couple projects as a geocoding fallback for Google Maps failures. \n\nThey also had more robust Neighborhood data that was very useful for my alive sites."
    },
    {
        "slug": "siteman",
        "name": "SiteMan",
        "description": "SiteMan is an internal Content Management System that was developed at Red 5 Interactive. I built this system from the ground up with our lead engineer and we deployed it to dozens of client web applications.  \n\nTo find out more about SiteMan itself, check out the <a href=\"/projects/siteman\">SiteMan project</a>."
    },
    {
        "slug": "twitter-api",
        "name": "Twitter API",
        "description": "I've gotten to use the Twitter API for a handful of professional projects, but I mostly use it for fetching my personal status updates and displaying them in various places.  It's a very fun API."
    },
    {
        "slug": "video-production",
        "name": "Video Production",
        "description": "Video production is really just a hobby of mine.  I tend to do work mostly for my own enjoyment, but I've been known to put together a music video, some rally videos, and a couple short films."
    },
    {
        "slug": "vue",
        "name": "Vue.js",
        "description": ""
    },
    {
        "slug": "wap",
        "name": "WAP",
        "description": "WAP (Wireless Application Protocol) was a standard for browsing minimal, lightweight data on mobile phones before larger phone screens and modern mobile web browsers arrived. I used it on one personal project to allow users to download wallpapers to their phones."
    },
    {
        "slug": "website-payments-pro",
        "name": "Website Payments Pro",
        "description": "Website Payments Pro is a payment gateway offered by PayPal.\n\nFeel free to check out some of my other <a href=\"/tags/e-commerce\">e-commerce applications</a>."
    },
    {
        "slug": "wordpress",
        "name": "Wordpress",
        "description": "I'm not a huge fan of Wordpress as it seems to require a lot of maintenance to keep it safe from exploits, but there were times where it just made sense to use.  I've used Wordpress to power a couple of the smaller side projects I've worked on."
    },
    {
        "slug": "xml",
        "name": "XML",
        "description": "I've always preferred JSON over the verbosity of XML, but XML is still a very powerful markup language - and I still enjoy using it.\n\nI can't even begin to list all the ways that I used XML in the early 2000s, but I ultimatley used it just like anyone else - to send, receive, and parse data."
    }
]